Revit 2027 API
ConduitSizeSettings.CreateConduitStandardTypeFromExisingStandardType Method
 Creates one conduit standard type with the new name and assign the conduit sizes to it from the existing standard type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CreateConduitStandardTypeFromExisingStandardType(
	Document pADoc,
	string newStandardName,
	string existingStandardName
)
Public Function CreateConduitStandardTypeFromExisingStandardType (
	pADoc As Document,
	newStandardName As String,
	existingStandardName As String
) As Boolean
public:
bool CreateConduitStandardTypeFromExisingStandardType(
	Document^ pADoc,
	String^ newStandardName,
	String^ existingStandardName
)
member CreateConduitStandardTypeFromExisingStandardType :
        pADoc : Document *
        newStandardName : string *
        existingStandardName : string -> bool
Parameters
pADoc Document
 The document.
newStandardName String
 The new conduit standard name.
existingStandardName String
 The existing conduit standard name.
Return Value
Boolean
 True if creating success; otherwise false.
Exceptions
Exception | Condition
ArgumentException |  The conduit standard name already exists. -or- The conduit standard name does not exist.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace